<a href="https://colab.research.google.com/github/Void-Brain70/Pandas/blob/main/Concat.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [30]:
import pandas as pd

Barcelona = pd.DataFrame({
    'Player Name':['Lionel Messi','Antoine Griezmann','Ousmane Dembélé'],
    'Age':[33,29,23],
    'Yearly Salary':['£52,000,000','£30,888,000','£11,024,000']
})
Barcelona

         Player Name  Age Yearly Salary
0       Lionel Messi   33   £52,000,000
1  Antoine Griezmann   29   £30,888,000
2    Ousmane Dembélé   23   £11,024,000

In [4]:
import pandas as pd

R_Madrid = pd.DataFrame({
    'Player Name':['Eden Hazard','Sergio Ramos','Toni Kroos'],
    'Age':[29,34,30],
    'Yearly Salary':['£21,164,000','£17,576,000','£17,108,000']
})
R_Madrid

    Player Name  Age Yearly Salary
0   Eden Hazard   29   £21,164,000
1  Sergio Ramos   34   £17,576,000
2    Toni Kroos   30   £17,108,000

In [5]:
new_df = pd.concat([Barcelona,R_Madrid])
new_df

         Player Name  Age Yearly Salary
0       Lionel Messi   33   £52,000,000
1  Antoine Griezmann   29   £30,888,000
2    Ousmane Dembélé   23   £11,024,000
0        Eden Hazard   29   £21,164,000
1       Sergio Ramos   34   £17,576,000
2         Toni Kroos   30   £17,108,000

In [6]:
new_df = pd.concat([Barcelona,R_Madrid],ignore_index=True)
new_df

         Player Name  Age Yearly Salary
0       Lionel Messi   33   £52,000,000
1  Antoine Griezmann   29   £30,888,000
2    Ousmane Dembélé   23   £11,024,000
3        Eden Hazard   29   £21,164,000
4       Sergio Ramos   34   £17,576,000
5         Toni Kroos   30   £17,108,000

In [7]:
new_df = pd.concat([Barcelona,R_Madrid],keys=["Barca","Real"])
new_df

               Player Name  Age Yearly Salary
Barca 0       Lionel Messi   33   £52,000,000
      1  Antoine Griezmann   29   £30,888,000
      2    Ousmane Dembélé   23   £11,024,000
Real  0        Eden Hazard   29   £21,164,000
      1       Sergio Ramos   34   £17,576,000
      2         Toni Kroos   30   £17,108,000

In [9]:
new_df.loc['Barca']

         Player Name  Age Yearly Salary
0       Lionel Messi   33   £52,000,000
1  Antoine Griezmann   29   £30,888,000
2    Ousmane Dembélé   23   £11,024,000

In [10]:
new_df.loc['Real']

    Player Name  Age Yearly Salary
0   Eden Hazard   29   £21,164,000
1  Sergio Ramos   34   £17,576,000
2    Toni Kroos   30   £17,108,000

In [21]:
import pandas as pd
Barcelona = pd.DataFrame({
    'Player Name':['Lionel Messi','Antoine Griezmann','Ousmane Dembélé'],
    'Yearly Salary':['£52,000,000','£30,888,000','£11,024,000']
})
Barcelona

         Player Name Yearly Salary
0       Lionel Messi   £52,000,000
1  Antoine Griezmann   £30,888,000
2    Ousmane Dembélé   £11,024,000

In [27]:
import pandas as pd
R_Madrid = pd.DataFrame({
    'Player Name':['Eden Hazard','Sergio Ramos','Toni Kroos'],
    'Age':[29,34,30]
})
R_Madrid

    Player Name  Age
0   Eden Hazard   29
1  Sergio Ramos   34
2    Toni Kroos   30

In [28]:
new_df = pd.concat([Barcelona,R_Madrid])
new_df

         Player Name Yearly Salary   Age
0       Lionel Messi   £52,000,000   NaN
1  Antoine Griezmann   £30,888,000   NaN
2    Ousmane Dembélé   £11,024,000   NaN
0        Eden Hazard           NaN  29.0
1       Sergio Ramos           NaN  34.0
2         Toni Kroos           NaN  30.0

In [29]:
new_df = pd.concat([Barcelona,R_Madrid],axis=1)
new_df

         Player Name Yearly Salary   Player Name  Age
0       Lionel Messi   £52,000,000   Eden Hazard   29
1  Antoine Griezmann   £30,888,000  Sergio Ramos   34
2    Ousmane Dembélé   £11,024,000    Toni Kroos   30

In [31]:
import pandas as pd

Barcelona = pd.DataFrame({
    'Player Name':['Lionel Messi','Antoine Griezmann','Ousmane Dembélé'],
    'Age':[33,29,23],
    'Yearly Salary':['£52,000,000','£30,888,000','£11,024,000']
})
Barcelona

         Player Name  Age Yearly Salary
0       Lionel Messi   33   £52,000,000
1  Antoine Griezmann   29   £30,888,000
2    Ousmane Dembélé   23   £11,024,000

In [33]:
s = pd.Series(['Argentina','France','France'],name="Nationality")
s

0    Argentina
1       France
2       France
Name: Nationality, dtype: object

In [34]:
df = pd.concat([Barcelona,s],axis=1)
df

         Player Name  Age Yearly Salary Nationality
0       Lionel Messi   33   £52,000,000   Argentina
1  Antoine Griezmann   29   £30,888,000      France
2    Ousmane Dembélé   23   £11,024,000      France